znowflak3/NRF52DK_ST7789/main.c
APP_TIMER_DEF(m_our_char_timer_id);
#define OUR_CHAR_TIMER_INTERVAL         APP_TIMER_TICKS(1000) // 1000ms intervals

APP_TIMER_DEF(m_our_clock_timer_id);
#define OUR_CLOCK_TIMER_INTERVAL         APP_TIMER_TICKS(60000) // 1000ms intervals


// STEP 5: Declare variable holding our service UUID
static ble_uuid_t m_adv_uuids[] = 
{
    {
        BLE_UUID_OUR_SERVICE,
        BLE_UUID_TYPE_VENDOR_BEGIN
    }
};

#define ST77XX_BLACK 0x0000
#define ST77XX_WHITE 0xFFFF
#define ST77XX_RED 0xF800
#define ST77XX_GREEN 0x07E0
#define ST77XX_BLUE 0x001F
#define ST77XX_CYAN 0x07FF
#define ST77XX_MAGENTA 0xF81F
#define ST77XX_YELLOW 0xFFE0
#define ST77XX_ORANGE 0xFC00

#define ST7789_CMD_SWRESET 0x01
#define ST7789_CMD_SLPOUT  0x11
#define ST7789_CMD_NORON   0x13
#define ST7789_CMD_INVON   0x21
#define ST7789_CMD_DISPON  0x29
#define ST7789_CMD_CASET   0x2A
#define ST7789_CMD_RASET   0x2B
#define ST7789_CMD_RAMWR   0x2C
#define ST7789_CMD_VSCRDEF 0x33
#define ST7789_CMD_COLMOD  0x3A
#define ST7789_CMD_MADCTL  0x36
#define ST7789_CMD_VSCSAD  0x37

#define BUFFER_SIZE 254

#define FRAMEBUFFER_WIDTH 240
#define FRAMEBUFFER_HEIGHT 320


//spi config
#define NRFX_SPIM_RESET_PIN  30
#define NRFX_SPIM_SCK_PIN     4
#define NRFX_SPIM_MOSI_PIN    3
#define NRFX_SPIM_MISO_PIN  255
#define NRFX_SPIM_SS_PIN     28
#define NRFX_SPIM_DCX_PIN    29

#define SPIM_INSTANCE 0
static nrfx_spim_t lcdSpi = NRFX_SPIM_INSTANCE(SPIM_INSTANCE); 
static nrfx_spim_config_t spi_config = NRFX_SPIM_DEFAULT_CONFIG;
//nrfx_spim_xfer_desc_t xfer_desc;

static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */

//commands
static uint8_t lcd_cmd_ramwr = ST7789_CMD_RAMWR;
static nrfx_spim_xfer_desc_t xfer_lcd_cmd_ramwr = NRFX_SPIM_XFER_TX(&lcd_cmd_ramwr, 1);

//clock config
static clock_position_t clock = {
    60,     //start x
    90,     //start y
    89,     //width
    149,    //height

    90,
    90,
    119,
    149,

    120,
    90,
    149,
    149,

    150,
    90,
    179,
    149
};

static clock_time_t clockTime = {
    0,
    0
};

void setWindow(uint8_t startX, uint8_t startY, uint8_t width, uint8_t height);
void drawNumber(uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint16_t textColor, uint16_t bgColor, uint8_t number);

static void advertising_start(bool erase_bonds);

static void timer_timeout_handler(void * p_context)
{
    //SEGGER_RTT_printf(0, "TICKTEST!");
    if(m_our_service.conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        int32_t temperature = 0;
        sd_temp_get(&temperature);
        //SEGGER_RTT_printf(0, "temp: %d\n", temperature);
        //SEGGER_RTT_printf(0, "current_temp: %d\n", m_our_service.current_temp);
        if(m_our_service.current_temp != temperature)
        {
            //SEGGER_RTT_printf(0, "changed temperature\n");
            our_temperature_characteristic_update(&m_our_service, &temperature);
            nrf_gpio_pin_toggle(20);
            m_our_service.current_temp = temperature;
        }
    }
}

static void clock_timer_handler(void * p_context)
{
    clockTime.minute++;

    if(clockTime.minute >= 60){
        clockTime.hour++;
        clockTime.minute = 0;

        

        if(clockTime.hour >= 24){
            clockTime.hour = 0;
        }
        //update display clock hours
        uint8_t leftHour = clockTime.hour / 10;
        uint8_t rightHour = clockTime.hour % 10;
              
        drawNumber(clock.startX_1, clock.startY_1, clock.width_1, clock.height_1, ST77XX_BLUE, ST77XX_BLACK, leftHour);
        drawNumber(clock.startX_2, clock.startY_2, clock.width_2, clock.height_2, ST77XX_BLUE, ST77XX_BLACK, rightHour);

        //nrf_delay_ms(500);
    }
    //update display clock minutes
    uint8_t leftMin = clockTime.minute / 10;
    uint8_t rightMin = clockTime.minute % 10;

    drawNumber(clock.startX_3, clock.startY_3, clock.width_3, clock.height_3, ST77XX_BLUE, ST77XX_BLACK, leftMin);
    drawNumber(clock.startX_4, clock.startY_4, clock.width_4, clock.height_4, ST77XX_BLUE, ST77XX_BLACK, rightMin);
    
    //nrf_delay_ms(500);
 
    SEGGER_RTT_printf(0, "Clock: %d:%d\n", clockTime.hour, clockTime.minute);
}



/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.
       ret_code_t err_code;
       err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
       APP_ERROR_CHECK(err_code); */

    err_code = app_timer_create(&m_our_char_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_our_clock_timer_id, APP_TIMER_MODE_REPEATED, clock_timer_handler);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            NRF_LOG_INFO("Connected to a previously bonded device.");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            NRF_LOG_INFO("Connection secured: role: %d, conn_handle: 0x%x, procedure: %d.",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

