znowflak3/NRF52DK_ST7789/main.c
}
void drawBuffer()
{
    
}
void drawNumber(uint8_t x, uint8_t y, uint8_t width, uint8_t height, uint16_t textColor, uint16_t bgColor, uint8_t number){
    
    setWindow(x, y, width, height);

    uint8_t bgColorData[] = {
        (uint8_t)(bgColor >> 8),
        (uint8_t)(bgColor & 0xFF)
    };
    nrfx_spim_xfer_desc_t bgData  = NRFX_SPIM_XFER_TX(&bgColorData, sizeof(bgColorData));

    uint8_t textColorData[] = {
        (uint8_t)(textColor >> 8),
        (uint8_t)(textColor & 0xFF)
    };
    nrfx_spim_xfer_desc_t textData  = NRFX_SPIM_XFER_TX(&textColorData, sizeof(textColorData));

    const uint16_t * numArray = sans_serif_30x60_get_number(number);
    setCommandPin();
    APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &xfer_lcd_cmd_ramwr, 0));
    setDataPin();

    for (int i = 0; i < 1800; i++)
    {
        if(numArray[i] == ST77XX_RED)
        {

            APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &bgData, 0));
        }
        else
        {
            APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &textData, 0));
        }   
       

    }
}

int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
	timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();
   

    // Start execution.
    NRF_LOG_INFO("started.");
    application_timers_start();

    advertising_start(erase_bonds);

    spim_init();
    // Enter main loop.

    
    const int16_t screenSizeX = 240;
    const int16_t screenSizeY = 240;


    // Hardware-reset the Screen controller
    nrf_gpio_pin_clear(NRFX_SPIM_RESET_PIN);
    nrf_delay_ms(15);

    nrf_gpio_pin_set(NRFX_SPIM_RESET_PIN);
    nrf_delay_ms(2);

    // Prepare the commands to software-reset the controller
    static uint8_t lcdTxSwreset = ST7789_CMD_SWRESET;
    static uint8_t lcdTxSlpout  = ST7789_CMD_SLPOUT;
    nrfx_spim_xfer_desc_t lcdXferSwreset = NRFX_SPIM_XFER_TX(&lcdTxSwreset, 1);
    nrfx_spim_xfer_desc_t lcdXferSlpout  = NRFX_SPIM_XFER_TX(&lcdTxSlpout, 1);

    static uint8_t lcdTxColmodCmd  = ST7789_CMD_COLMOD;
    static uint8_t lcdTxColmodData = 0x55;
    nrfx_spim_xfer_desc_t lcdXferColmodCmd  = NRFX_SPIM_XFER_TX(&lcdTxColmodCmd, 1);
    nrfx_spim_xfer_desc_t lcdXferColmodData = NRFX_SPIM_XFER_TX(&lcdTxColmodData, 1);

    static uint8_t lcdTxMadctlCmd  = ST7789_CMD_MADCTL;
    static uint8_t lcdTxMadctlData = 0;
    nrfx_spim_xfer_desc_t lcdXferMadctlCmd  = NRFX_SPIM_XFER_TX(&lcdTxMadctlCmd, 1);
    nrfx_spim_xfer_desc_t lcdXferMadctlData = NRFX_SPIM_XFER_TX(&lcdTxMadctlData, 1);

    static uint8_t lcdTxLast[] = {
            ST7789_CMD_INVON,
            ST7789_CMD_NORON,
            ST7789_CMD_DISPON
    };
    nrfx_spim_xfer_desc_t lcdXferLast = NRFX_SPIM_XFER_TX(lcdTxLast, sizeof(lcdTxLast));

    //write
    
    uint16_t bgColor = ST77XX_BLACK;
    uint8_t lcdTxRamwrData[] = {
        (uint8_t)(bgColor >> 8),
        (uint8_t)(bgColor & 0xFF) 
    };

    uint8_t lcdcmd = ST7789_CMD_RAMWR;

    
    nrfx_spim_xfer_desc_t xferCmd  = NRFX_SPIM_XFER_TX(&lcdcmd, 1);
    nrfx_spim_xfer_desc_t xferData = NRFX_SPIM_XFER_TX(lcdTxRamwrData, sizeof(lcdTxRamwrData));

 

    // Send the commands
    setCommandPin();
    APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &lcdXferSwreset, 0));
    nrf_delay_ms(150);

    APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &lcdXferSlpout, 0));
    nrf_delay_ms(10);

    APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &lcdXferColmodCmd, 0));
    setDataPin();
    APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &lcdXferColmodData, 0));
    nrf_delay_ms(10);

    setCommandPin();
    APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &lcdXferMadctlCmd, 0));
    setDataPin();
    APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &lcdXferMadctlData, 0));

    setWindow(0, 0, screenSizeX, screenSizeY);

    setCommandPin();
    APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &lcdXferLast, 0));
    nrf_delay_ms(10);

    //write bg black
    
    setCommandPin();
    APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &xferCmd, 0));
    setDataPin();

    int sbs = 57600;

    for(int i = 0; i < sbs; i++){
        APP_ERROR_CHECK(nrfx_spim_xfer(&lcdSpi, &xferData, 0));
    }
    
    //clock
    drawNumber(clock.startX_1, clock.startY_1, clock.width_1, clock.height_1, ST77XX_BLUE, ST77XX_BLACK, clockTime.hour / 10);
    drawNumber(clock.startX_2, clock.startY_2, clock.width_2, clock.height_2, ST77XX_BLUE, ST77XX_BLACK, clockTime.hour % 10);
    drawNumber(clock.startX_3, clock.startY_3, clock.width_3, clock.height_3, ST77XX_BLUE, ST77XX_BLACK, clockTime.minute / 10);
    drawNumber(clock.startX_4, clock.startY_4, clock.width_4, clock.height_4, ST77XX_BLUE, ST77XX_BLACK, clockTime.minute % 10);
    

    for (;;)
    {
        
        //NRF_LOG_INFO("test ending");
        //NRF_LOG_FLUSH();
    }
        while (!spi_xfer_done)
        {
            __WFE();
        }

        NRF_LOG_FLUSH();

        bsp_board_led_invert(BSP_BOARD_LED_0);
        nrf_delay_ms(200);
        
}


/**
 * @}
 */
